# Nike Sales Dataset Analysis
**Context:** This dataset contains 2,500+ synthetic sales transactions from Nike's retail and online channels. It includes product info, sales channels, discounts, revenue, profit, and customer segments.  
**Goal:** Clean the dataset, perform analysis, and build actionable dashboards.

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

# Extraction
In this phase, we load the raw Nike sales dataset into Python using Pandas.  
This dataset simulates retail and online transactions, and contains messy, uncleaned data.  
The goal of this step is to make the data accessible for cleaning and analysis.

In [2]:
# Load raw CSV into DataFrame
df = pd.read_csv("../data/Nike_Sales_Uncleaned.csv")

# Exploring data

In [3]:
df.head()

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit
0,2000,Kids,Training,SuperRep Go,M,NaN,NaN,0.47,0.0,2024-03-09,Online,bengaluru,-770.45
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,NaN,0.0,2024-07-09,Retail,Hyd,-112.53
2,2002,Women,Soccer,Premier III,M,4.0,NaN,NaN,0.0,NaN,Retail,Mumbai,3337.34
3,2003,Kids,Lifestyle,Blazer Mid,L,NaN,9673.57,NaN,0.0,04-10-2024,Online,Pune,3376.85
4,2004,Kids,Running,React Infinity,XL,NaN,NaN,NaN,0.0,2024/09/12,Retail,Delhi,187.89

In [4]:
df.sample()

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit
2109,4109,Kids,Training,SuperRep Go,12,NaN,9731.83,NaN,0.0,2024/11/29,Online,Mumbai,-675.88

In [5]:
df.shape

(2500, 13)

In [6]:
df.tail()

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit
2495,4495,Kids,Basketball,Kyrie Flytrap,XL,3.0,NaN,NaN,0.0,2025-05-14,Online,Pune,2.97
2496,4496,Men,Basketball,Kyrie Flytrap,L,-1.0,NaN,NaN,0.0,NaN,Online,Hyd,-487.36
2497,4497,Men,Soccer,Tiempo Legend,7,NaN,6647.60,0.52,0.0,02-07-2025,Retail,Bangalore,-918.14
2498,4498,Women,Training,ZoomX Invincible,NaN,4.0,5358.70,NaN,0.0,11-12-2024,Online,Mumbai,3352.29
2499,4499,Women,Running,Air Zoom,M,NaN,5550.99,NaN,0.0,23-11-2024,Retail,Mumbai,2453.57

In [7]:
print("Column Names:", df.columns.tolist())

Column Names: ['Order_ID', 'Gender_Category', 'Product_Line', 'Product_Name', 'Size', 'Units_Sold', 'MRP', 'Discount_Applied', 'Revenue', 'Order_Date', 'Sales_Channel', 'Region', 'Profit']

In [8]:
df.dtypes

Order_ID              int64
Gender_Category      object
Product_Line         object
Product_Name         object
Size                 object
Units_Sold          float64
MRP                 float64
Discount_Applied    float64
Revenue             float64
Order_Date           object
Sales_Channel        object
Region               object
Profit              float64
dtype: object

In [9]:
print("Nulls per column:\n", df.isnull().sum())

Nulls per column:
 Order_ID               0
Gender_Category        0
Product_Line           0
Product_Name           0
Size                 510
Units_Sold          1235
MRP                 1254
Discount_Applied    1668
Revenue                0
Order_Date           616
Sales_Channel          0
Region                 0
Profit                 0
dtype: int64

In [10]:
print(f"Duplicate rows: {df.duplicated().sum()}")
print(f"Duplicate Order_IDs: {df.duplicated(subset='Order_ID').sum()}")

Duplicate rows: 0
Duplicate Order_IDs: 114

# Transformation
This phase involves cleaning and preparing the dataset for analysis.  
Key transformations include:
- Filling missing values for `Size`, `Units_Sold`, `MRP`, `Discount_Applied`, and `Order_Date`
- Standardizing region names and fixing typos
- Handling negative or zero `Units_Sold`
- Correcting unrealistic discounts (>100%) and recalculating revenue
- Ensuring correct data types (`datetime`, `float`, `int`)  
- Optional: flagging returns or negative profits for business insights

# Step 1: Handle Missing Values

In [11]:
# Fill missing Size values with the most frequent value (mode)
df["Size"] = df["Size"].fillna(df["Size"].mode()[0])

# Fill Units_Sold nulls with median
df["Units_Sold"] = df["Units_Sold"].fillna(df["Units_Sold"].median())

# Fill MRP nulls with median
df["MRP"] = df["MRP"].fillna(df["MRP"].median())

# Fill Discount_Applied nulls with 0 (assume no discount)
df["Discount_Applied"] = df["Discount_Applied"].fillna(0)

# Convert Order_Date to datetime
df["Order_Date"] = pd.to_datetime(df["Order_Date"], errors="coerce")

# Fill missing Order_Date with the most frequent date
df["Order_Date"] = df["Order_Date"].fillna(df["Order_Date"].mode()[0])

In [12]:
print("Nulls per column:\n", df.isnull().sum())

Nulls per column:
 Order_ID            0
Gender_Category     0
Product_Line        0
Product_Name        0
Size                0
Units_Sold          0
MRP                 0
Discount_Applied    0
Revenue             0
Order_Date          0
Sales_Channel       0
Region              0
Profit              0
dtype: int64

In [13]:
df.head(5)

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit
0,2000,Kids,Training,SuperRep Go,M,2.0,6110.03,0.47,0.0,2024-03-09,Online,bengaluru,-770.45
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,0.00,0.0,2024-07-09,Retail,Hyd,-112.53
2,2002,Women,Soccer,Premier III,M,4.0,6110.03,0.00,0.0,2024-12-21,Retail,Mumbai,3337.34
3,2003,Kids,Lifestyle,Blazer Mid,L,2.0,9673.57,0.00,0.0,2024-12-21,Online,Pune,3376.85
4,2004,Kids,Running,React Infinity,XL,2.0,6110.03,0.00,0.0,2024-12-21,Retail,Delhi,187.89

# Step 2: Remove Duplicate Transactions

In [14]:
# Check duplicates
df.duplicated(subset='Order_ID').sum()

np.int64(114)

In [15]:
# Remove duplicates
df = df.drop_duplicates(subset='Order_ID', keep='first')

In [16]:
df.shape

(2386, 13)

**To ensure transaction uniqueness and accurate sales totals, duplicate Order_ID entries were removed.**

# Step 3: Handle region name typo

In [17]:
# Show all unique cities in the Region column
unique_cities = df['Region'].unique()
print(unique_cities)

#Count how many times each city appears,This helps spot rare typos:
print(df['Region'].value_counts())

['bengaluru' 'Hyd' 'Mumbai' 'Pune' 'Delhi' 'Bangalore' 'Hyderabad'
 'hyderbad' 'Kolkata']
Region
Delhi        412
Mumbai       405
Kolkata      390
Pune         376
bengaluru    212
Bangalore    203
hyderbad     137
Hyd          129
Hyderabad    122
Name: count, dtype: int64

### Cleaning the Region Column
We standardize region names by correcting common typos and abbreviations:
- 'Bengaluru' → 'Bangalore'
- 'Hyd' and 'hyderbad' → 'Hyderabad'

This ensures accurate grouping and analysis by region.

In [18]:
df['Region'] = df['Region'].str.strip().str.title()  # standardize capitalization

# Replace common typos and abbreviations in Region
df['Region'] = df['Region'].replace({
    'Bengaluru': 'Bangalore',
    'Hyd': 'Hyderabad',
    'Hyderbad': 'Hyderabad'
})

In [19]:
# Show all unique cities in the Region column
unique_cities = df['Region'].unique()
print(unique_cities)

#Count how many times each city appears,This helps spot rare typos:
print(df['Region'].value_counts())

['Bangalore' 'Hyderabad' 'Mumbai' 'Pune' 'Delhi' 'Kolkata']
Region
Bangalore    415
Delhi        412
Mumbai       405
Kolkata      390
Hyderabad    388
Pune         376
Name: count, dtype: int64

# Step 4: Handle Negative Profit

In [20]:
# Count how many transactions have negative profit
negative_profit_count = (df['Profit'] < 0).sum()
print(f"Number of transactions with negative profit: {negative_profit_count}")

# Create a flag to identify transactions with losses
df['Loss_Flag'] = df['Profit'] < 0

Number of transactions with negative profit: 544

In [21]:
negative_profit_percentage = (negative_profit_count / len(df)) * 100
print(f"Percentage of transactions with negative profit: {negative_profit_percentage:.2f}%")

Percentage of transactions with negative profit: 22.80%

# Step 5: Validate revenue calculations

In [22]:
df.head(3)

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit,Loss_Flag
0,2000,Kids,Training,SuperRep Go,M,2.0,6110.03,0.47,0.0,2024-03-09,Online,Bangalore,-770.45,True
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,0.00,0.0,2024-07-09,Retail,Hyderabad,-112.53,True
2,2002,Women,Soccer,Premier III,M,4.0,6110.03,0.00,0.0,2024-12-21,Retail,Mumbai,3337.34,False

In [23]:
# Count of negative or zero Units_Sold
invalid_units = df[df['Units_Sold'] <= 0]
print(f"🧾 Invalid Units_Sold (<=0): {len(invalid_units)} rows")

# Optional: view a few examples
invalid_units[['Units_Sold', 'Product_Name', 'Region']].head()

🧾 Invalid Units_Sold (<=0): 408 rows

    Units_Sold   Product_Name     Region
8         -1.0    Premier III  Hyderabad
11        -1.0   Flex Trainer  Hyderabad
12        -1.0     Blazer Mid      Delhi
19         0.0       Air Zoom  Hyderabad
20        -1.0  Tiempo Legend     Mumbai

In [24]:
# Convert negative Units_Sold to positive
# This assumes negative values represent returns or data entry errors,
# and we want to analyze the absolute quantity sold for revenue calculations.
df['Units_Sold'] = df['Units_Sold'].abs()

In [25]:
# Count of negative or zero Units_Sold
invalid_units = df[df['Units_Sold'] < 0]
print(f"🧾 Invalid Units_Sold (<=0): {len(invalid_units)} rows")

🧾 Invalid Units_Sold (<=0): 0 rows

In [26]:
#Recalculate and replace the 'Revenue' column
df['Revenue'] = df['Units_Sold'] * df['MRP'] * (1 - df['Discount_Applied'] / 100)

In [27]:
df.head(3)

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit,Loss_Flag
0,2000,Kids,Training,SuperRep Go,M,2.0,6110.03,0.47,12162.625718,2024-03-09,Online,Bangalore,-770.45,True
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,0.00,14873.790000,2024-07-09,Retail,Hyderabad,-112.53,True
2,2002,Women,Soccer,Premier III,M,4.0,6110.03,0.00,24440.120000,2024-12-21,Retail,Mumbai,3337.34,False

# Step 6: Standardize Product_Line & Gender_Category
Fix capitalization or typos for consistent grouping.

In [28]:
df['Product_Line'] = df['Product_Line'].str.strip().str.title()
df['Gender_Category'] = df['Gender_Category'].str.strip().str.title()

In [29]:
df.head(3)

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit,Loss_Flag
0,2000,Kids,Training,SuperRep Go,M,2.0,6110.03,0.47,12162.625718,2024-03-09,Online,Bangalore,-770.45,True
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,0.00,14873.790000,2024-07-09,Retail,Hyderabad,-112.53,True
2,2002,Women,Soccer,Premier III,M,4.0,6110.03,0.00,24440.120000,2024-12-21,Retail,Mumbai,3337.34,False

# Step 7: Convert Columns to Correct Data Types
Make sure numeric columns are actually numeric.

In [30]:
df['Units_Sold'] = pd.to_numeric(df['Units_Sold'], errors='coerce')
df['MRP'] = pd.to_numeric(df['MRP'], errors='coerce')
df['Discount_Applied'] = pd.to_numeric(df['Discount_Applied'], errors='coerce')
df['Revenue'] = pd.to_numeric(df['Revenue'], errors='coerce')
df['Profit'] = pd.to_numeric(df['Profit'], errors='coerce')

# Step8: Outlier Detection
Sometimes, there are transactions with unrealistically high prices or units.

In [31]:
# Remove outliers using IQR
Q1 = df['Revenue'].quantile(0.25)
Q3 = df['Revenue'].quantile(0.75)
IQR = Q3 - Q1
df = df[~((df['Revenue'] < (Q1 - 1.5 * IQR)) | (df['Revenue'] > (Q3 + 1.5 * IQR)))]

In [32]:
df.shape

(2339, 14)

In [33]:
df.head()

,Order_ID,Gender_Category,Product_Line,Product_Name,Size,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Sales_Channel,Region,Profit,Loss_Flag
0,2000,Kids,Training,SuperRep Go,M,2.0,6110.03,0.47,12162.625718,2024-03-09,Online,Bangalore,-770.45,True
1,2001,Women,Soccer,Tiempo Legend,M,3.0,4957.93,0.00,14873.790000,2024-07-09,Retail,Hyderabad,-112.53,True
2,2002,Women,Soccer,Premier III,M,4.0,6110.03,0.00,24440.120000,2024-12-21,Retail,Mumbai,3337.34,False
3,2003,Kids,Lifestyle,Blazer Mid,L,2.0,9673.57,0.00,19347.140000,2024-12-21,Online,Pune,3376.85,False
4,2004,Kids,Running,React Infinity,XL,2.0,6110.03,0.00,12220.060000,2024-12-21,Retail,Delhi,187.89,False

In [34]:
df.describe()

,Order_ID,Units_Sold,MRP,Discount_Applied,Revenue,Order_Date,Profit
count,2339.000000,2339.000000,2339.000000,2339.000000,2339.000000,2339,2339.000000
mean,3249.913211,1.858487,6023.505122,0.208563,11069.969386,2024-11-16 06:09:23.317656832,1387.742326
min,2000.000000,0.000000,2006.630000,0.000000,0.000000,2023-07-26 00:00:00,-1199.320000
25%,2623.500000,1.000000,6042.120000,0.000000,6110.030000,2024-12-21 00:00:00,102.925000
50%,3250.000000,2.000000,6110.030000,0.000000,12194.397874,2024-12-21 00:00:00,1377.720000
75%,3870.500000,2.000000,6110.030000,0.320000,13400.850000,2024-12-21 00:00:00,2686.870000
max,4499.000000,4.000000,9995.550000,1.250000,25889.250000,2025-07-22 00:00:00,3999.210000
std,722.609390,0.930005,1608.277225,0.363438,6054.453334,NaN,1479.051009

In [38]:
df = df[df['Units_Sold'] > 0]  # keeps only rows where Units_Sold is positive

# Step 9: Final Data Validation & Double-Check
 Purpose: Ensure dataset is clean and ready for analysis

In [40]:
# ==============================
# Step X: Final Data Validation & Double-Check
# Purpose: Ensure dataset is clean and ready for analysis
# ==============================

# 1️⃣ Check for null values
print("---- Null Values per Column ----")
print(df.isnull().sum())
print("\n")

# 2️⃣ Check for negative Units_Sold
invalid_units = df[df['Units_Sold'] <= 0]
print(f"🧾 Invalid Units_Sold (<0): {len(invalid_units)} rows")
print(invalid_units[['Units_Sold', 'Product_Name', 'Region']].head(), "\n")

# 3️⃣ Check for negative or zero MRP
invalid_mrp = df[df['MRP'] <= 0]
print(f"💰 Invalid MRP (<=0): {len(invalid_mrp)} rows")
print(invalid_mrp[['MRP', 'Product_Name']].head(), "\n")

# 4️⃣ Check for unrealistic discounts (<0 or >100)
invalid_discount = df[(df['Discount_Applied'] < 0) | (df['Discount_Applied'] > 100)]
print(f"🎟️ Invalid Discounts (<0 or >100): {len(invalid_discount)} rows")
print(invalid_discount[['Discount_Applied', 'Product_Name', 'Region']].head(), "\n")


# Check data types
print("---- Column Data Types ----")
print(df.dtypes, "\n")

# Spot-check categorical values
print("---- Unique Regions ----")
print(df['Region'].unique())
print("\n---- Unique Product Lines ----")
print(df['Product_Line'].unique())
print("\n---- Unique Gender Categories ----")
print(df['Gender_Category'].unique(), "\n")

# Check for duplicate Order_IDs
duplicate_orders = df.duplicated(subset='Order_ID').sum()
print(f"Duplicate Order_IDs: {duplicate_orders}")

---- Null Values per Column ----
Order_ID            0
Gender_Category     0
Product_Line        0
Product_Name        0
Size                0
Units_Sold          0
MRP                 0
Discount_Applied    0
Revenue             0
Order_Date          0
Sales_Channel       0
Region              0
Profit              0
Loss_Flag           0
dtype: int64


🧾 Invalid Units_Sold (<0): 0 rows
Empty DataFrame
Columns: [Units_Sold, Product_Name, Region]
Index: []

💰 Invalid MRP (<=0): 0 rows
Empty DataFrame
Columns: [MRP, Product_Name]
Index: []

🎟️ Invalid Discounts (<0 or >100): 0 rows
Empty DataFrame
Columns: [Discount_Applied, Product_Name, Region]
Index: []

---- Column Data Types ----
Order_ID                     int64
Gender_Category             object
Product_Line                object
Product_Name                object
Size                        object
Units_Sold                 float64
MRP                        float64
Discount_Applied           float64
Revenue                    float64
Order_Date          datetime64[ns]
Sales_Channel               object
Region                      object
Profit                     float64
Loss_Flag                     bool
dtype: object

---- Unique Regions ----
['Bangalore' 'Hyderabad' 'Mumbai' 'Pune' 'Delhi' 'Kolkata']

---- Unique Product Lines ----
['Training' 'Soccer' 'Lifestyle' 'Running' 'Basketball']

---- Unique Gender Categories ----
['Kids' 'Women' 'Men']

Duplicate Order_IDs: 0

# Loading
The cleaned and transformed dataset is now ready for analysis, visualization, and business decision-making.  
We save the cleaned dataset as a CSV so it can be easily used in dashboards (Power BI / Tableau) or further analysis.

In [41]:
# Save the cleaned DataFrame to the 'data' folder (one level up from notebooks)
df.to_csv("../data/Nike_Sales_Cleaned.csv", index=False)

In [43]:
df.shape

(2123, 14)

# ETL Pipeline Complete

We have successfully completed the **End-to-End ETL Pipeline** for the Nike sales dataset.  

**Summary of what has been done:**
- **Extracted** the raw data from CSV into Python.  
- **Transformed** the data by cleaning missing values, correcting typos, standardizing categories, handling negative/zero values, recalculating revenue, and validating all key columns.  
- **Loaded** the cleaned dataset into both a CSV file and optionally a SQLite database, ready for analysis, dashboards, and business insights.  

The data is now **clean, structured, and ready for exploratory analysis, visualization, and predictive modeling**, forming a strong foundation for building a portfolio-ready project.